{"version":"0.4","title":"n 6","type":"page","content":[{"id":"58d0bd33","settings":[],"elements":[{"id":"4c05f8a1","settings":{"_column_size":100},"elements":[{"id":"573f0e39","settings":{"editor":"<!-- wp:paragraph -->\n<p><strong><em>SRANK UNIVERSITY<\/em><\/strong> is San Diego’s best Reggio university offering organic meals and serving the greater San Diego area including Poway, Mission Valley, La Mesa, Allied Gardens and Kensington. Our preschool was created to provide enriching,&nbsp;quality care through play-based learning. We offer a clean and inviting environment and healthy, organic food will always be served.&nbsp;&nbsp;Whether you need full-time or part-time care, you will find that SRANK UNIVERSITY is the perfect place for your child. Feel free to browse our interactive website to learn more about the best preschool and daycare in San Diego! You can contact us anytime and we would love to meet you and your Little Sprout!<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>One of the basic ideals of<strong><em> Srank University<\/em><\/strong>  is to achieve an intellectual synthesis of oriental and occidental learning of the best that has been thought of and said, both in the East and in the West. Further it aims at a cultural synthesis (as reflected in its architectural variety), the development of a national ethos, and the creation of an academic and social environment in which 'National Integration' is not a nebulous idea but a tangible reality.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The birth of<strong><em> Srank University<\/em><\/strong> almost coincided with the birth of a new order arising from the ashes of the First World War. Its origin was basically patriotic. It was a revolt against the supremacy of the foreign language in India. On the revolutionary experiment of using a regional language as a medium of higher education the Nobel Laureate poet, Rabindranth Tagore, observed:<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>\"I have long been waiting for the day when, freed from the shackles of a foreign language, our education becomes naturally accessible to all our people. It is a problem for the solution of which we look to our Native States, and it gives me great joy to know that your State proposes to found a University in which instructions are to be given through the medium of Urdu. It is needless to say that your scheme has my fullest appreciation........................\"<\/p>\n<!-- \/wp:paragraph -->"},"elements":[],"isInner":false,"widgetType":"text-editor","elType":"widget"}],"isInner":false,"elType":"column"}],"isInner":false,"elType":"section"}]}